import save_data

path = './Zk2904.csv'
str1 = '绿帘石化斜长角闪片岩：灰绿、灰黑色，粒状变晶结构，片状构造，主要矿物成分为：斜长石、角闪石及少量的绿帘石（约5%)、石英、石榴子石等。岩石中普具绿帘石化，沿裂隙面及片理发育，呈脉状、薄膜状，局部受构造影响呈不规则脉状、团块状分布。岩层上部黄铁矿化较发育，呈脉状、致密星点状分布。岩石中局部可见石英脉受构造影响呈团块状、不规则脉状分布，宽约5mm个别可达1cm岩石局部可见长英质斑点、石榴子石分布。岩石片理裂隙发育，想、岩层下部角闪石含量较高。'
str2 = '斜长角闪片岩：灰绿、灰黑色，粒状变晶结构，片状构造，主要矿物成分为：斜长石（3540%)、角闪石（45-50%)及少量石英、钾长石等。岩石局部可见沿裂隙面及片理发育绿帘石化、绿泥石化、碳酸盐化及铁猛质，局部绿帘石化及黄铁矿化极其发育，可见沿裂隙呈脉状分布，岩石表面可见黄铁矿化呈星点状、团块状分布。岩石局部见钾长石化分布，呈斑点状，造影响，个别呈不规则团块状、扭曲变形状。其中（孔深411.9-0412,20m)、（孔深416.50-416.80m)处岩石钾长石化极其发育，受铹性剪切影响与长英质脉体杂乱穿插分布，可见石《镜体分布其中。岩石局部片理不发育，斜长石定向排列，呈条带状，大部分岩石较完整，局部呈碎块状。'
str3 = '钾长石化斜长角闪片岩：灰绿、肉红色，粒结椅T^T状掏造T^T物成分为厂齋长石、角闪石及少量的钾长石（约5%)、石英、绿帘石等。岩石中普具钾长石化，颜色为肉红色，呈斑点状、脉状，受构造影响，呈不规则团块状、不规则线状分布，斑点状（大小约2x3mm)、不规则团块状（一^约为8xl〇mm)、不规则线状（一^宽约5mm)。岩石局部具硅化、绿帘石化、绿泥石化、黄铁f；化，桂体处黄铁矿化较发育，呈星点状、团块状，个别受构造影响呈脉状分布。其中2〇4_204|(孔深442.9^45.90m)处岩石中长英质讀较高，錄白色，沿裂隙面及片理产出ME状。其中2〇4-204:(孔獅_7D-444.20m)处长英廳其黑育，鄭块贫。'
str4 = '钾长石化斜长角闪片岩：灰绿、肉红色，粒结椅T^T状掏造T^T物成分为厂齋长石、角闪石及少量的钾长石（约5%)、石英、绿帘石等。岩石中普具钾长石化，颜色为肉红色，呈斑点状、脉状，受构造影响，呈不规则团块状、不规则线状分布，斑点状（大小约2x3mm)、不规则团块状（一^约为8xl〇mm)、不规则线状（一^宽约5mm)。岩石局部具硅化、绿帘石化、绿泥石化、黄铁f；化，桂体处黄铁矿化较发育，呈星点状、团块状，个别受构造影响呈脉状分布。其中2〇4_204|(孔深442.9^45.90m)处岩石中长英质讀较高，錄白色，沿裂隙面及片理产出ME状。其中2〇4-204:(孔獅_7D-444.20m)处长英廳其黑育，鄭块贫。'
str5 = '斜长角闪片岩：灰绿、灰黑色，粒状变晶结构，片状构造，主要矿物成分为：斜长石、角闪石及少量的石英等。岩石中局部可见沿裂隙面发育绿帘石化、绿泥石化、碳酸盐化、铁锰质。局部可见黄铁矿化沿裂隙发育呈星点状、浸染状、粒状集合体？局部可见岩石较破碎，呈碎块状，大小一般约为IX2(^较大者可达3X4cm〇其中2504(孔深540.50-54075m)处可见岩石呈灰白色，石英脉沿片麵隙发育，受构造影响呈杂乱交错状。其中253j:(孔深550.00-550.50m)处可见岩石中具钾长石化，钾长石呈团块状产出，大小约5x10吨局部具绿帘石化。'
str6 = '绿帘石化斜长角闪片岩：灰绿色，粒状变晶结构，片状构造，主要矿物成分为：斜长石、角闪石及少量的绿帘石（约5%)、石英等。岩石中普具绿帘石化，沿片理裂隙发育绿泥石化、碳酸盐化。碳酸盐化呈薄膜状，局部呈细脉状，局部岩$节理裂隙发育，较破碎，可见沿裂隙发育黄铁矿化，呈星点状，个别呈细脉状。气中281&孔深614.40414‘80m)处可见岩石具钾长石化，钾长石呈团块状产出。其中2874-2874(孔深624.95-625.70m)处可见岩石具强硅化、黄铁矿化，黄铁矿化沿裂隙呈细脉状、粒状集合体分布。岩石下部難化，绿帘石化发育较弱。'
str7 = '二云石英片岩：灰白、灰黑色：鱗片状变晶结构，片状构造，主要矿物成份为：黑云母、白云母、石英及少童的斜长石等。岩石中局部可见沿裂酿发育绿帘石化、绿泥石化、碳酸盐化^局等可见长英质细脉沿片理裂隙产出，宽约4_其中，312!M?L深684.6CH685.0㈣、314，（孔深689.00^689.80m)处可见岩石難化、3碎裂岩典、黄铁矿化沿裂隙分布，旱尾点状，石英咏呈团块状产出，宽约5cm其中，3226一3226(孔深709.00-709.90m)处叶见岩石具弱硅化、黄铁矿化沿裂隙发育，黄铁矿化呈星点状、浸染状，局部呈小细脉状。岩层TlfP黄铁矿化不发育。'

str = [str1, str2, str3, str4, str5, str6, str7]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './Zk2902.csv'
str1 = '斜长角闪片岩灰绿-灰黑色，粒柱状变晶结构，片状构造。矿物成份以角闪石为主，斜长石为次，含少量石英、黄铁矿，碳酸盐款物等。其屮在孔深360-362.00米段，岩石硅化黄铁矿化较强。硅化石英呈乳白、灰白色，团块状、脉状产出；黄铁矿，浅黄色，自形-半自形晶，呈星点状、浸染状分布。'
str2 = '金矿石经化学分析，H3Au品位为13.81X1〇_6，经野外二次编录，该段为金矿石。旷石矿物为黄铁矿，浅黄色，呈自形-半自形粒状，粒径0.1-0.3mm，M星点状、浸染状分布。脉石矿物为角闪石、斜长石、石英等。其巾角闪石含量占40-50%，斜长石含童占30-40%，石英占少呈：。'
str3 = '斑点状斜长角闪片岩灰白-灰绿色，粒柱状变晶结构，斑状结构，片状构造。斑晶由石英、长石组成，斑晶大小5-10mm，含量20-25%;基质由角闪石、斜长石、石英组成。岩石片理较发育，局部见硅化、碳酸盐化。'
str4 = '斜长角闪片岩灰绿色，粒柱状变晶结构，片状构造。矿物成份以角闪石为主，斜长石为次，含少量石英、黄铁矿、碳酸盐矿物等。岩石片理较发育，局部具硅化、黄铁矿化、碳酸盐化。硅化石英灰白色，呈团块状分布。黄铁矿，浅黄色，呈星点状分布。碳酸盐脉沿不规则裂隙分布。'
str5 = '金矿石经化学分析，H6Au品位为37.23X10_6,经野外二次编录，该段为佥矿石。矿石矿物为黄铁矿，浅黄色，呈自形-半自形粒状，粒径0.2-0.3mm，多呈浸染状分布。脉石矿物为角闪石、斜长石、石英等。其中角闪石为黑色，短柱状，含量占55%左右；斜长石，灰白色，粒状，粒径0.1-0.4mm，含暈占30-40%。'
str6 = '斜长角闪片岩灰绿色，粒柱状变晶结构，片状构造。矿物成份以角闪石为主，斜长石为次，含少童石英、黄铁矿等。岩石局部具斑状结构，斑晶由长石、石英组成，斑晶大小5-10mm，含量约5%。岩石局部具硅化、黄铁矿化，硅化石英呈细脉状分布，黄铁矿呈星点状分布。'
str7 = '金矿石经化学分析，H9Au品位为24.44X1〇_«，经野外二次编录，该段为金矿石。矿石矿物为黄铁矿，浅黄色，呈自形-半自形粒状，粒径0.05-0.3mm,呈浸染状分布。脉石矿物为角闪石、斜长石、石英等„角闪石、斜长石呈粒柱状。石英呈脉状分布，脉宽2-5mm。'
str8 = '斜长角闪片岩灰绿-灰黑色，粒柱状变晶结构，片状构造。矿物成份以角闪石为主，斜长石为次，含少量石英、黄铁矿等。局部岩石含斑晶，斑晶由石英、长石构成，斑晶大小5-1Omm,含量约6%。岩石片理较发育，局部具硅化、黄铁矿化。插化石英呈细脉状、团块状产出；黄铁矿，呈星点状、浸染状分布。'
str = [str1, str2, str3, str4, str5, str6, str7, str8]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './Zk3702.csv'
str1 = '金矿石经化学分析，H2金品位为2.3〇x10_6,经野外二次编录，该段为金矿石。矿石矿物为黄铁矿，浅黄色，呈自形-半自形粒状，粒径0.1-0.3mm，含量1-1.5V。，呈浸染状、星点状分布。脉石矿物：角闪石含量40-45%，斜长石含量30-35%，石英、绿帘石含童5-10%。'
str2 = '金矿石经化验分析，H9金品位为2.94X1〇_«*，经野外二次编录，该段为金矿石，矿石矿物为黄铁矿，呈自形-半自形粒状，粒径0.01-0.3mm,浅黄色。脉石矿物为角闪石、斜长石、石英、绿帘石等。角闪石含量40-45%,斜长石含量30-40%,石英含量5-10%'
str3 = '金矿石经化验分析，H16-H17AU平均品位为22.84X1〇_6,经野外二次编录，该段为金矿石。矿石矿物为黄铁矿，浅黄色、呈自形-半自形粒状，粒径0.1-0.3mm,含量约3%,呈星点状、浸染状分布。脉石矿物主要为斜氏石、角W石，次为石英等。'
str4 = '金矿石经化验分析，H20-H21处AuT.均品位为25.52X10 经野外二次编录，该段为金矿石，矿石矿物为黄铁矿，浅黄色，呈自形-半自形較状，較径0.05-0.3_含量2.5-3.0、多呈浸染状分布。脉石矿物为石英、白乂吁、黑z：•母集石英呈粒状、脉状分布，脉宽0.5-lcnwd云母、黑云母呈片状。'
str5 = '斜长角闪片岩灰绿-灰黑色，局部夹杂灰白色，粒柱状变晶结构，片状构造。局部略具块状构造，矿物成分为角闪石、斜长石，次为石英、绿帘石以及少量的白云母和碳酸盐类矿物等。局部岩石具硅化、碳酸盐化、绿帘石化，岩石中硅化伴随石英-碳酸盐脉沿不同方向的裂隙面充填。'

str = [str1, str2, str3, str4, str5]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './Zk5902.csv'
str1 = '二云石英片岩灰白色，鱗片状变晶结构，片状构造〇矿物成份：石英含童约45%白云母含量10-15%，黑云母与白云母含量20-25、斜长石含量20-25%„另含少量碳酸盐矿物。岩石片理较发育，局部呈弱碳酸盐化。畀石局部见长英质细脉，细脉沿不同方向的裂隙填充。'
str2 = '金矿石经化学分析，H2金品位7.65X10弋经野外二次编录，该段为金矿石。矿石矿物为黄铁矿，浅黄色，呈自形部自形粒状，粒径呈浸麟、星点状分布。脉石矿物为白云母、黑云母、石英等。白云母、黑云母为片状，石英为粒状。'
str3 = '金矿脉灰白色，夹肉红色，原岩为二云石英片岩，受热液作用影响矿化较强，具桂化、黄铁矿化较强。硅化伴随石英产出，乳白-灰白色，呈团块状、脉状分布。黄铁矿，浅黄色，自形-半S形晶，呈团块状、觀状分布。矿化赃沿不规则的裂隙分布。岩石局鹏弱碳酸盐化。'
str4 = '金矿脉灰内色，夹肉红色，原岩为二云石英片岩，受热液作用影响矿化较强，具抵化、黄铁矿化较强。插化伴随石英产出，乳白-灰白色，呈团块状、II承状分布。黄铁矿，浅黄色，自形-半自形晶，呈团块状、浸染状分布。矿化蚀变沿不规则的裂隙分布。岩石局部具弱碳離也'
str5 = '斜长角闪岩灰绿色，立柱桩变晶结构，片状构造。矿物成份：角闪石含量约50%，斜长石含量约25%，另含少量绿帘石、黄铁矿、石英等。岩石片理较发育，局部具硅化、黄铁矿化，规划石英，灰白色，呈脉状分布。黄铁矿，浅黄色，呈星点状、浸染分布。'
str = [str1, str2, str3, str4, str5]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './Zk7501.csv'
str1 = '弱黄铁矿化二云石英片岩灰黑色、&白色/鱗片粒状变晶结构，片状构造；主要矿物成分为石英、黑云母、白云母、斜长石以及少贵钾长石、碳酸盐类矿物等。局部岩石中可见微弱黄铁矿化，黄铁矿呈星点状散布在岩石中，偶见浸染状分布的黄铁矿。局部岩石中可见碳酸盐化呈细脉状沿e理面分布。'
str2 = '矿化蚀变带颜色灰黑色，原岩为二云石英片岩。岩石中可见明显的黄铁矿化伴随硅化出现，黄佚矿呈细脉状、浸染状分布在硅化周围。另含少S的碳酸盐化和绿帘石化。'
str3 = '黄铁矿化斜长角闪片岩颜色灰绿色、灰黑色，粒状变晶结构，片状构造。主要矿物成份：角闪石含M55-60%;斜长石含M20-30V。，以及少量的黑云母及石英含S10%。岩石局部具有硅化，硅化呈团块状分布，粒径0.3-0.5mm;场部吋见少M的黄铁矿.黄铁矿呈粒状、星点状分布，顔色浅黄色，泣径0.1-0.3cm之间，自形-半自型晶。'
str4 = '矿化蚀变带颜色灰黑色，原岩为斜长角闪片岩。岩石中可见黄铁矿化，其中黄铁矿呈浸染状、星点状分布。局部含有少S的硅化、碳酸盐化。'
str5 = '金矿石经化验分析，H13AU品位为9.64x1(T6，经野外二次编录，该段为金矿石，矿石矿物为黄铁矿，浅黄色，呈自形-半自形粒状，粒径0.1-0.3mm，含童约2-2.5%。脉石矿物主要为斜长石、角闪石，以及少童的石英等。斜长石呈粒状，含量占50%左右；角闪石呈短柱状，含萤占40%左右；石英呈细咏状分布，脉宽〇.5-lcm。'
str6 = '黄铁矿化斜长角闪片岩颜色灰绿色、灰黑色，粒状变晶结构，片状构造◊主要矿物成份：角闪石、斜长石，少最的石英、绿帘石等。局部岩石中具有硅化，硅化呈团块状及细脉状分布，团块粒径0.2-0.5cm:脉宽0.3-0.局部可见黄铁矿化，黄铁矿圼粒状，粒径0.1-0.3cm,自形-半自型晶，成浸染状分布。'
str7 = '金矿石经化验分析，H17-H18号样Au平均品位为1.49X1〇_«，经野外二次编录，该段为金矿石。矿石矿物为黄铁矿，浅黄色，呈自形-半自形粒状，粒径0.2-0.3mm,呈沒染状、星点状分布。脉石矿物主要为斜长石、角闪石，次为石英等。其中斜长石呈粒状，角闪石呈短柱状，石英呈脉状。'
str8 = '斜长角闪片岩颜色灰绿色、灰黑色，粒状变晶结构，片状构造。中.要矿物成份：角闪石含量45_55%;斜长石含量20-30%，少量的石英、绿帘石等。局部岩石中具硅化、绿帘石化、碳酸盐化等，少童的黄铁矿化，黄铁矿圼星点状分布，颜色浅黄色。'
str9 = '斜长龟闪片岩颜色灰绿色、灰黑色，粒状变晶结构，片状构造。主要矿物成份：角闪石、斜长石，以及少量的石英、绿帘石等C局部岩石具硅化，绿帘石化，碳酸盐化等，少量的黄铁矿化，黄铁矿浅黄色，呈星点状分布。细粒状，自形-半自形晶。'
str10 = '金矿石经化验分析，H25-H26号样Au品位为1.8〇x1〇_6，经野外二次编录，该段为金矿石。矿石矿物为黄铁矿，浅黄色，呈自形-半自形粒状，粒径0.2-0.4mm。咏石矿物为斜长石、角闪石以及少M的绿泥石等。'
str11 = '矿化蚀变带颜色灰绿色、灰黑色，原岩为斜长角闪片岩。岩石中可见硅化、黄铁矿化及少童的绿泥石化，黄铁矿呈浅黄色、粒状，粒径在0.1-0.3cm之间，呈团块状、浸染状分布。自形-半自形晶。'
str12 = '斜氏角闪片岩颜色灰绿色、灰黑色，粒状变晶结构，片状构造。主要矿物成份：角闪石含ft40-55%，斜长石含童20-30%,少量的石英、绿帘石等。局部岩石中具硅化、绿帘石化以及少量的碳酸盐化、黄铁矿化，黄铁矿呈星点状分布。局部岩石中可见云母，片状，大小0.2-0.5cm,不规则分布。'
str13 = '经化验分析，H30-H31号样Au平均品位6.〗8x10 经野外二次编录，该段为金矿石，矿石矿物为黄铁旷，浅黄色，呈自形-半自形粒状，粒径含量约2-2.5、多呈浸染状分布。脉石矿物主要为斜长石、角闪石，次为绿泥石等。斜长石、角闪石为雛状，绿泥石为片札'
str14 = '斜长角闪岩颜色灰A色，灰绿色，粒状变晶结构，块状构造。主要矿物成份：角闪石、斜长石，以及少量的石英、绿帘石等。局部岩石具轻微硅化，绿帘石化、黄铁矿化，黄铁矿呈星点状分布。'

str = [str1, str2, str3, str4, str5, str6, str7, str8, str9, str10, str11, str12, str13, str14]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './zk2201.csv'
str1 = '斜长角闪片岩：顔色为灰黑-灰绿色，粒柱状变晶结构，片理构造6主要矿物成分角闪石、绿帘石、或绿泥石含量占50~60%^斜长石含量占30—40%可见到少量的碳质和白云母等。岩石局雜碳麵匕黄铁矿I在孔深92.MH94.30米处岩石受力挤压变形，用小锤敲打破碎，呈碎块状、棱角状，大岩石只辟裂岩化、碳酸盐化、货铁矿化货铁矿呈浸染状、星点状分布a。'
str = [str1]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './zk3201.csv'
str1 = '斜长角闪片岩(钾长石化)：灰绿色夹杂灰白色，粒状变晶结构，片状构造、块状构造。矿物成分：角闪石含约50—70%，粒柱状，灰绿色，大小0.2—1.5mm;斜长石含约20_30%，灰白色，它形粒状，大小0.3—局部集合体呈团块状，大小1—15mm不等；石英含约5—10°/^它形粒状，粒径0.2—0.5吗局部集合体呈团块状、细脉枕少量云母、碳酸盐矿物等。岩石普具钾长石化，肉红色，多呈团块状，大小1.5—20mm^等，部分呈细脉状穿插。岩石普具碳酸盐化，灰白色，呈细脉状、团块状3细脉产状无规律，部分顺层产出。78回次(76.90—78.50米)岩石较破碎，呈碎块状。82—89回次(83.50—89.20米)岩石局部收納长斑岩脉影响，成分上趋向于钠长斑岩。改层岩石局部放大镜下观察可见细小的黄铁矿，含量极少。'
str2 = '碎裂斜长角闪片岩：灰绿、青灰色，粒状变晶结构，片状构造(碎裂结构)。矿物成分以角闪石为主(50—70%);斜长石为次(20—30%);少量石英(5_10%)及云母、暗色矿物等。岩石整体交破碎，普具弱碳酸盐化，呈细脉状、团块状，局部岩石具弱硅化、绿帘石化。103回次(108.21——108.41米)岩石含少量黄铁矿，呈星点状，粒度细小。'
str3 = '绿帘石化斜长角闪片岩：黄绿、青灰色，粒状变晶结构，片状、块状构造。矿物成分：角闪石50-70%，灰绿色，粒柱状，粒径0.2-1.2mm;斜长石含约15-30%，灰白色，它形粒状，大小0.3—0.6mm;石英5—10%，灰白色，它形粒状，大小0.3-0.7mm;少量绿帘石、碳酸盐等。岩石普具绿帘石化，黄绿色，呈团块状、细脉状，团块大小3-10與脉宽0.5—2mm;岩石局部碳酸盐化较强，呈团块状，细脉状，团块大小2—5111^脉宽2—5mm〇113—114回次孔深118.05—121.95米岩石呈变余斑状结构，斑晶含量10。/在右，大小0.8-31^成分角闪石为主，斜长石为次，部分石英，放大镜下可见少量粒状黄铁矿，粒倒127回次孔深144.70-145.20米岩石呈灰白色，成分角闪石含量变小，约30-50;斜长石30—400/^破20—30%。'
str = [str1, str2, str3]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './zk0001.csv'
str1 = '含炭质碎裂岩化斜长角闪片岩颜色为灰绿-灰黑色，碎裂结构，碎裂、片状构造，主献物成分为角闪石#*50%，斜长石含量35%，其它为黑云母含量15%该层岩石片理发育.岩石中可见有碳质，灰黑色、污手，岩石受构造影响，岩心局部较破碎，呈碎块状。岩石中可见有长英质细脉，脉宽0.1-0.511^呈不规则状分布。岩石中可见有少量的黄铁矿，黄铁矿呈细粒状分布，黄铁矿呈自形-半自形晶•该层在223回次306.90-225回次308.50米处夹有薄层石英钠长斑岩脉，颜色为灰白色.'
str = [str1]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './zk0002.csv'
str1 = '金矿石经采样分析，该层134.77-136.27m^H12Au品位为2.05XKT6。野外二次编录，该段为金矿石，矿石矿物为黄铁矿，呈半自形一它形粒状，粒径〇.〇2〜0.2啊浅黄色，呈浸染状、团块状分布，含量约1%〇脉石矿物为石英、角闪石和斜长石等，石英呈脉状分布，脉宽烟灰色；角闪石和斜长石呈粒柱状，角闪石含量约50%，斜长石约40其它见绿帘石和石榴子石等。'
str2 = '矿化蚀变带（弱黄铁矿化、硅化斜长角闪片岩）颜色为灰绿、灰黑色，粒柱状变晶结构，片状构造。主要矿物成分角闪石、斜长石、绿帘石及云母、石英。该层岩石具硅化，硅化较强，呈团块状分布。粒径l-3Cm〇岩石局部具碳质，污手。岩石中可见少量浅黄色黄铁矿，呈细粒状分布，粒径1-21^呈自形-半自形晶。'
str3 = '矿化蚀变带（硅化、黄铁矿化斜长角闪片岩）颜色为灰绿、灰黑色，粒柱状变晶结构，片状构造。岩石受初性剪切作用，岩石较破碎，呈碎块状，局部具糜棱岩化。岩石具碳质。可见有硅化，硅化较强，呈团块状，粒径2-3cm〇还可见有浅黄色黄铁矿，呈细粒、浸染状分布，粒径0.5-lim^呈自形-半自形晶、它形晶。'
str = [str1, str2, str3]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './zk7901.csv'
str1 = '方铅矿化斜长角闪片岩灰绿、灰黑色，粒柱状变晶结构，片状构造。主要矿物成份：角闪石含量约55%，斜长石含量约30%左右，绿帘石含量约5-10%。岩石中可见有少量方铅矿呈金属光泽，粒径l-3mm。'
str2 = '石英脉乳白色、白色，油脂光泽，断口呈贝壳状，隐晶质粒状结构，块状构造，主要成份石英含量达90%以上，绿帘石含量约5%。'
str3 = '金矿石经化验分析，H52号样Au品位为1.34X10"6。野外二次编录，该段为金矿石，矿石矿物为黄铁矿，呈半自形-它形粒状，粒径0.01〜0.3_，浅黄色，含量约1%。脉石矿物主要为角闪石和斜长石，次为石英等。角闪石和斜长石呈粒柱状，石英呈脉状分布，脉宽〇.5-lmm，烟灰色；角闪石含量约50%，斜长石约40%,其它见绿帘石及黑云母等。'
str4 = '金矿石经化验分析，H54号样Au品位1.27X10_6。经野外二次编录，该段为金矿石。矿石矿物为黄铁矿，呈半自形-它形粒状，粒径〇.〇5-0.3inm，浅黄色，含量约1.5%。脉石矿物为角闪石、斜长石和石英等。角闪石和斜长石呈粒柱状，石英呈脉状分布，脉宽约0.5-2mm，烟灰色；角闪石含量约55%，斜长石约35%，其他见绿帘石和绿泥石等。'
str5 = '择裂岩化斜长角闪岩灰黑、灰绿色，粒柱状变晶结构，块状构造。矿物成分为角闪石含量50-55%、斜长石含量20-25%左右，绿帘石含量约5-8%。其它为少量石英及黑云母。'
str6 = '石英钠长斑岩脉颜色为灰白、灰黄色，斑状结构，块状构造。斑晶主要为石英，钠长石为粒状，大小0.5-1.5mm，约占15%，基质灰白色，成分主要为长英质，颗粒细小，肉眼不易辨认。该层岩石在孔深275.54-277.14米处可见有少量方铅矿化，金属光泽，呈集合体状分布。还可见有少量浅黄色黄铁矿，呈细粒状分布，粒径l-3mm，呈自形-丰自形晶。'
str7 = '斜长角闪片岩颜色为灰绿、灰黑色，粒柱状变晶结构，片状构造。主要矿物成分角闪石含量50-55%，斜长石含量20-25%，其它为绿帘石及少量石英、黑云母。岩石中可见有绿帘石，呈粒状分布，粒径l-3mm。岩石中可见有少量长英质细脉，呈细脉状、条带状分布，脉宽〇.l-〇.5cm。岩石中沿裂隙面上还可见有少量碳酸盐化。该层岩石在孔深281,04-282.04米、291.22-292.22米处具弱硅化，硅化呈团块状、条带状分布。岩石中可见有少量浅黄色黄铁矿，呈细粒状、浸染状分布，粒径l-2mm，呈自形-半自形晶、它形晶。'
str8 = '绿帘石化斜长角闪片岩灰黑、灰绿色，粒柱状变晶结构，片状构造。矿物成分为角闪石含量50-55%、斜长石含量25%，绿帘石含量约10-15%,次之为少量石英。岩石中可见有绿帘石，呈粒状分布，粒径1-3mm。岩石中可见有少量长英质细脉，呈不规则状、细脉状分布，脉宽0.1-0.3cm。局部较破碎，呈碎裂岩化。岩石中沿裂隙面上可见有少量碳酸盐化。该层岩石在孔深296.92-298.52米处岩石较破碎，呈碎裂岩化、糜棱岩化。岩石具碳质，污手。岩石中可见有少量浅黄色黄铁矿，呈细粒状、浸染状分布，粒径l-2mm，呈自形-半自形晶。'
str = [str1, str2, str3, str4, str5, str6, str7, str8]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './zk7902.csv'
str1 = '碎裂岩化斜长角闪岩：颜色为灰绿、灰黑色，粒柱状变晶结构，块状构造。主要矿物成分角闪石含量55%，斜长石含量35%，其他为绿帘石、石英及少量黑云母。岩石中可见有长英质细脉，呈细脉状分布，脉宽0.2-0.3吨岩石受构造影响，岩石较破碎，呈碎裂岩化。岩石中局部具桂化，硅化一般，呈条带状分布。岩石中可见有少量浅黄色黄铁矿，呈细粒状分布，粒径0.1-0.2rnm^呈自形-半自形晶。'
str = [str1]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './zk1111.csv'
str1 = '金矿石经化验分析，5.46-8.01m处平均品位为1.68x10乂经野外二次编录，该段为金矿石，矿石矿物为黄铁矿，呈半自形-它形粒状，粒径0.1-0.3im^浅黄色。脉石矿物为斜长石、角闪石和绿帘石等。斜长石和角闪石呈粒柱状，斜长石含量约40%，角闪石含量约微绿帘石呈粒状，錄约5%。'
str2 = '强风化斜长角闪片岩：颜色为灰褐一土黄色，粒状结构，片状构造。主要矿物成分：斜长石含量30%，角闪石含量55%，其它为黑云母含量15%。'
str3 = '斜长角闪片岩颜色为灰绿-灰黑色，粒状结构，片状构造.主要矿物成分为角闪石含量60%.斜长石含量25%.其它为黑云母及少量石英含量15%.该层岩石片理较发育。岩石中可见有少量绿帘石化，绿帘石呈条带状、粒状分布。粒径在0.3-0.6cm〇条带状宽约0.1-0.4cm^间。岩石中可见有少量长英质细脉，脉宽在〇.2-〇.4cm^间，呈细脉状分布。该层岩石局部可见少量黄白色黄铁矿，黄铁矿呈粒状分布，粒径在0.2-0.5cm^间，呈自形-半自形晶。'
str4 = '含麵碎裂岩颜色为灰绿-灰黑色，碎裂结构，碎裂构造.主要矿物成分为角闪石含量60%.斜长石含量30%.其它为黑云母、石英含量10%。该层岩石受构造影响，岩石破碎较重，岩心呈碎块状、短柱状，呈碎裂岩化。岩石中可见有少量长英质细脉，脉宽在0.2-0.4cm^间，呈细脉状分布。岩石中局部含碳质，灰黑色，污手。岩石中可见有少量黄铁矿，黄铁矿呈粒状分布，粒径在0.3-0.5mm之间。黄铁矿呈自形-半自形晶。'
str5 = '含碳质碎裂岩化斜长角闪片岩颜色为灰绿一灰黑色，碎裂结构，碎裂构造，主要矿物成分为角闪石含量60、斜长石讀25%，其它为黑云母、石英雜15%〇'
str6 = '金矿石经化验分析，H4号样Au品位为1.22x10 经野外二次编录，该段为金矿石，矿石矿物为黄铁矿，呈细粒状，獅.1-〇.3啊浅黄色，呈魏状、细粒状分布。含量约1-1.5%。脉石矿物为斜长石、角闪石、石英等。斜长石和角闪石呈粒柱状，石英呈细脉状分布;斜长石雜3私角闪石含量40%>石英含量15%〇'
str7 = '含碳质碎裂岩化斜长角闪片岩颜色为灰绿—灰黑色，碎裂结构，碎裂构造，主要矿物成分为角闪石含量60%，斜长石含量25%,其它为黑云母、石英含量15%。岩石中可见有长英质细脉，脉宽(X2-0.7cm之间，呈不规则状分布。岩石中可见有碳质，灰黑色、污手，局部可见碳酸盐化。岩石中可见有少量的黄铁矿，黄铁矿呈细來立状分布，粒径0.1-0.3mm〇黄铁矿呈自形一半自形晶局荀^化，硅化较弱。'
str8 = '碎裂岩化斜长角闪片岩颜色为灰绿-灰黑色，碎裂结构，碎裂构造.主要矿物成分为角闪石含量60%.斜长石含量30%.其它为黑云母、石英含量10%。该层岩石受构造影响，岩石较破碎，呈碎裂岩化。岩芯呈碎块状、短柱状。岩石中可见有长英质细脉，脉宽在〇.l-〇.3cm^间，呈细脉状、不规则状分布。岩石中局部具硅化，硅化较弱，呈团块状、条带状分布。岩石中可见有少量黄白色黄铁矿，黄铁矿呈粒状分布，粒径在0.2-0.4cm^间。局部沿裂隙面上分布，呈薄臟分布。黄铁矿呈自形一半自形晶。'
str9 = '黄铁矿化斜长角闪片岩颜色为灰we黑色，粒状航片状构造•主要矿物成分为角闪石#*55%.斜长石含量25%.其它为黑云母、石英、绿帘石含*20%.该层咨石片理较发育。右石中可见有少量绿帘石化，绿帘石呈鎌状分布。宽约0.3-0.5cm岩石中可见有少量长麵细脉，脉宽在0.1-0.2cm^间，呈细脉状分布。岩石中局部岩石较破碎，呈碎裂岩化。岩石中可见少量黄铁矿，黄铁矿呈粒状分布，粒径在〇.2-0.3mm之间，局部富集，呈集合体状分布。呈自形-半自形晶。'
str10 = '金矿石经采样化验分析，H81、H63号样AU平均品位为1.4〇x10 野外二次编录，该段为金矿石，矿物減铁矿，呈半自形-它形粒状，粒獅5-0.3啊浅黄色，含量约1、脉石矿物为角闪石、斜长石和石英等。角闪石、斜长石呈粒柱状，石英呈脉状，角闪石含量40、斜长石含量3〇%>石英含童20%〇'
str11 = '绿帘石化黄铁矿化碎裂岩颜色为灰绿-浅灰色，碎裂结构，碎裂构造.主要矿物成分为角闪石含量50%.斜长石含量30%.其它为石英、绿帘石含量20%'
str12 = '弱桂化碎裂岩颜色为灰白-灰绿色，碎裂结构，碎裂构造.主要矿物成分为角闪石含量50%.斜长石含量20%•其它为石英及黑云母含量30%。该层岩石受构造蚀变影响，岩石较破碎。岩石中可见有少量长英质细脉，脉宽在〇.2-〇_7啤呈条带状、不规则状分布。岩石雛化呈团块状、条带状分布。岩石中可见有黄白色黄铁矿，黄铁矿呈粒状、集合体状分布，粒径在0.3-0.7nm局部沿裂隙面分布，呈薄臟分布。黄铁矿呈自形-半自形、它形晶。'
str13 = '金矿石经化验分析H72-H68号样Au平均品位为1.32x10 野外二次编录，该段为金矿石，矿石矿物为黄铁矿，呈半自形-它形粒状。粒径〇.14.2興浅黄色，含量约1%。脉石矿物为角闪石、斜长石、石英及少量黑云母。角闪石和斜长石呈粒柱状，石英呈团块状，黑云母呈鱗片状。角闪石含量450A斜长石35%,石英及黑云母10%。'
str14 = '弱硅化碎裂岩颜色为灰白—灰绿色，碎裂结构，碎裂构造.主要矿物成分为角闪石含量50%.斜长石含*20%.其它为石毅零星黑云赠量30%〇'
str15 = '含碳质碎裂岩颜色为灰绿-灰黑色，碎裂结构，碎裂构造，主要矿物成分为角闪石含量50%,斜长石含量20、其它为石英及少量黑云母含量30%。该层岩石受构造蚀变影响。岩石较破碎，岩心呈碎块状、短柱状，呈碎裂岩化。岩石中可见有长英质细脉，脉宽〇.2-〇.4Cm之间，呈条带状、不规则状分布。岩石中可见有碳质，灰黑色、含量约5%岩石局部具桂化。硅化呈条带状、团块状分布，条带状宽约0.5-0.7C吼团块状粒径l-3cm〇岩石可见有少量的黄铁矿，浅黄色，黄铁矿呈粒状分布，粒径0.2-0.4mra〇呈自形碑自形晶。'
str = [str1, str2, str3, str4, str5, str6, str7, str8, str9, str10, str11, str12, str13, str15]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './Zk3921.csv'
str1 = '糜棱岩化斜长角闪片岩灰色-灰白色，糜棱结构，定向构造，片状构造，主要矿物成分为角闪石、 斜长石，及少量的石英、方解石等。该层岩石片理较发育，整体糜棱岩化，局部可见方解石脉不连续分布。'
str2 = '硅化黄铁矿化斜长角闪片岩灰绿、黄绿色，局部灰白色，粒柱状变晶结构，片状构造。主要矿物成分 为角闪石、斜长石及少童的绿泥石、石英、黄铁矿等。该层岩石整体硅化、黄铁矿化较好，局部绿泥石化。黄铁矿呈细粒浸染状 呆点状分布，石英呈团块状浸染状分布，整体矿化蚀变较好。'
str3 = '硅化钾长石化斜长角闪片岩灰黑色，局部肉红色，粒柱状变晶结构，片状构造。主要矿物成分为角闪 石、斜长石及少量的石英、钾长石等。孔深402.40-406.75m岩石钾长石化、硅化发育，肉红色，团块状，黄铁矿 呈团块状、星点状。孔深386.00-402.40m岩石灰黑色，硅化较发育。'
str4 = '辟仆绿泥石仆斜长角1X1片岩灰黑色，黄绿色夹灰白色，粒柱状变晶结构，片状构造。主要矿物成分为 角闪石、斜长石，及少量的石英、绿泥石、黄铁矿等。孔深447.80-458.50m岩石灰绿-白色，硅化黄铁矿化发育，黄铁矿呈浸染 状，团块状分布。孔深463.40-477.00m，岩石黄绿色为主，局部硅化、黄铁矿化较好。'
str5 = '矿化带灰白色黄绿色，主要矿物成分角闪石、斜长石及少量的石英、黄铁矿等。该层矿化蚀变较好，硅化黄铁矿化发育，局部含少量碳质。'
str6 = '斜长角闪片•岩灰色灰黑色，粒柱状变晶结构，片状构造。主要矿物成分为角闪石、斜长 石，及少量的石英、黄铁矿等。孔深515.20-518.00m岩石黄绿色，硅化、黄铁矿化较发育。'
str7 = '斜长角闪片岩灰黑色灰白色，局部黄绿色，粒柱状变晶结构，片状构造。主要矿物成分 为角闪石、斜长石，及少量的绿泥石、石英、黄铁矿等。该层岩石局部绿泥石化，黄铁矿化、硅化较发育。孔深551.40-553.50m岩石灰白-黄绿，硅化黄铁矿化较好，黄铁矿呈细 粒备桌状分布。孔深561.30-562.60m566.00-567.50m岩石灰黑色，呈碎块状，硅化较 好，黄铁矿化一般。孔深571.30-576.70m岩石黄绿-灰黑色，黄铁矿化较好。孔深585.60-60〗.00m岩石呈黄绿色，局部硅化、黄铁矿化较好。孔深601.00-605.00m岩石较破碎，灰白-黄绿色，硅化较好。孔深619.40-622.30m岩石黄绿-灰白色，硅化较好，黄铁矿呈星点状分布'
str8 = '硅化斜长角闪片岩灰黑夹灰白色，粒柱状变晶结构，片状构造。主要矿物成分为角闪石、斜 长石，及少量的石英、绿泥石等。该层岩石硅化较发育，局部绿泥石化，呈黄绿色，可见少量的粗粒黄铁矿 孔深635.50-636.60m岩石硅化黄铁矿化较发育，取样观察。'
str = [str1, str2, str3, str4, str5, str6, str7, str8]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './ZK4001.csv'
str1 = '绿帘石化斜长片岩灰绿色。粒柱状变晶结构，片状构造„主要矿物成分.•斜长A含量60~ 70%左冇； 石英含量10%&右；绿帘石含量15~20拎及少量的碳酸盐化矿物筝孔齡34.75〜236.40m、250.42~ 251.85鐵岩石具明显娃化、黄铁矿化。陆化呈脉 状、团块状；黄铁矿呈浸染状、团块状分布于娃化周围。局部岩A具碳酸盐化等。'
str2 = '桂化二云石英片岩灰白色。鱗片粒状变晶结构，片状构造。主要矿物成分：白云母、黑云母、石英、 角闪石、斜长石，以及少量的碳酸盐化矿物等。孔418.30~420.10m、424.05、425.75mg，岩石具桂化、黄铁矿化。娃化呈条带状 分布；黄铁矿呈浸染状、团块状分布。'
str3 = '碎裂岩化斜长角闪片岩：灰黑色。岩石受构造作用，破碎强烈，呈碎块状，大小在0.5〜 1.5cm之间。局部岩石完整。岩石具桂化、弱黄铁矿化。硅化呈条带状分布；黄铁矿呈星 点状分布。局部可见绿泥石化、绿帘石化、碳酸盐化等。'
str4 = '绿帘石化硅化斜长角闪片岩灰白色，局部灰绿色。粒柱状变晶结构，片状构造。主要矿物成分：斜长石、角闪石 、石英、绿帘石，及少量的碳酸盐化矿物等。孔深517.60〜537.10m、541.55〜542.75ir^岩石具黄铁矿化。黄铁矿浅黄色，呈浸染 状、局部团块状分布，且分布很不均勻。多沿桂化分布。局部岩石具碳酸盐化〇'
str = [str1, str2, str3, str4]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './Zk1432.csv'
str1 = '碎裂岩化斜长角闪片岩青灰、灰白色，粒状变晶结构，块状-片状构造。矿物成分以角闪石为主，斜长石为 次，偶见石英、黄铁矿等。该层岩石位于下层长英质岩脉顶板，岩石受脉体构造影响。呈碎块状，近接触带岩石 碎裂岩化较强烈，岩石已蚀变褪色，硅化、黄铁矿化较发育，呈细脉状、块状分布，黄 铁矿呈细粒星点状分布，局部呈浸染状、团块状。'
str2 = '石英钠长斑岩脉灰白色，隐晶结构、斑状结构，块状构造。矿物成分主要为钠长石、少 量石英及微量黄铁矿、方解石等。岩心较完整，局部沿裂隙充填灰白色碳酸盐 细脉，黄铁矿颗粒细小，呈星点状分布。'
str3 = '碎裂岩化斜长角闪片岩青灰、灰白色，粒状变晶结构，块状-片状构造。矿物成分以角闪石为主，斜长石为 次，少量碳酸盐类矿物、绿帘石，偶见石英、黄铁矿等。该层位丁脉体底板，近接触面器石呈麟、灰雜碎裂者化鄉，偶见黄铁矿化、硅 化，呈星点状、块状、细脉齡布。'
str4 = '斜长角闪片岩^灰绿-灰黑色，粒柱状变晶结构，块状-片状构造。矿物成分：角闪石含量50-60%， 斜长石含量35-45%，少歸帘石、黄铁矿等。岩石片理不发育，普颠桂化、弱绿帘石化，_黄铁矿化，碎裂岩化较发育，硅化 多呈块状分布，黄铁矿多呈顧状分布。孔深234.56-236.51米段岩石插化、黄铁矿化呈浸染状分布。孔深240.01-242.91米段若石黄铁矿化、硅化较发育，硅化呈块状、浸染状分布，黄 铁矿呈星点状、浸染状分布。158回次岩石局部经蚀变已褪色，岩石中偶见星点状黄铁矿化分布。孔深264.54-266.03米段岩石中可见星点状黄铁矿发育，颗粒细小，该处位于下层钠长 斑转脉魏嫌面浸染状黄铁矿较发育。'
str5 = '灰黑色、灰绿色、灰白色、黄绿色，粒状变晶结构，块状构造。岩石原岩斜长角闪片岩 ，经构造蚀变后，原岩特征不明显，岩石绿帘石化、娃化、黄铁矿化、绿泥石化较发育，局 部桂化、黄铁矿较强，呈浸染状、斑点状、块状、细脉状分布。黄铁矿颗粒细小，浅黄色 ，雛0.2-0.6mra^ 等，个别可达 l-1.5mm〇孔深272.94-274.89米段岩石蚀麵烈，黄铁矿化、硅化纖，呈浸染状、团块状、细脉 状分布。孔勸77.64-279.54^^石桂化、黄铁矿倾烈’呈团块状分布。孔獅2.1^284.54米段岩石桂化较强烈，偶见星点状黄铁矿分布〇	'
str6 = '金矿石靴学分析，该的H祕样品结果为2.09X 10 野外二次编录，该段为金矿石 。矿石矿物为黄铁矿，呈半自形一它形粒狀雜0.2 - 0城浅黄色。脉石矿物主要为斜长石和角闪石，次为石英 > 绿泥石和方解石等 > '
str7 = '矿化带灰白、灰绿色、灰白色、黄绿色，粒柱状鱗片变晶结构，块状-片状构造。成分以角闪 片岩、斜长石为主，绿帘石、绿泥石为次，少量石英、方解石及微量黄铁矿等。岩石片理 较发育。岩石受构造蚀变影响已褪色，硅化、黄铁矿化较强，呈浸染状、块状、斑点状分布。 沿裂隙充填方解石细脉。经化学分析，319.61-321,11m的H50样品结果为1.70X 1〇乂为金矿石。野外二次 编录，矿石矿物为黄铁矿，细粒状，含量1—1.5%;脉石矿物为斜长石和角闪石等。'
str8 = '斜长角闪片岩灰绿一灰黑色，粒柱状变晶结构，块状一片状构造。矿物成分以角闪石为主，斜长石为 次，少遣绿帘石、方解石、石英^黄铁矿等。岩石较完整，矿化蚀变—般，孔深358.71-360.11米段岩石硅化、黄铁矿化较发育，呈块状、星点状分布。'
str9 = '桂倾长角闪片岩灰白、灰绿-灰黑色，粒状变晶结构，块状-片状构造。主要矿物成角闪石50-60%, 斜长石3(M0%，少量绿帘石、石英、方解石及微量黄铁矿等。岩石片理不发育，普難化，呈细脉状、块状、浸染状分布，局部岩石黄铁矿化、 绿帘石化较发育，黄铁矿呈星点状分布。孔深398.66-399.16米段岩石桂化，绿帘石化较强，呈浸染状、细脉状，黄铁矿较发育 :呈星点状、斑点状。孔深406.51M07.01米段岩石黄铁矿化、桂化较发育，呈星点状块'
str10 = '斜长角闪片岩（黄铁矿化）灰绿-灰黑色，粒柱状变晶结构，块状-片状构造。主要矿物成分角闪石含量50-70% ，斜长石含量25峭0%，少量绿帘石、方解石、偶见石英、黄铁矿。岩石片理總育。岩石普具弱绿帘石化，弱碳酸盐化，局部硅化、黄铁矿化较发育，绿帘石化、碳酸盐 化多沿裂隙面呈薄雜、皮壳状，少量呈块状。孔深521.26-523.91米段岩石硅化、黄铁矿化较发育，呈浸染状、细脉状分布，黄铁矿 多呈星点状、浸染状分布。孔深526.86-529.29雜岩石黄铁矿化较发育，呈浸染状、星点状分布。孔深533.79-537.54米段岩石黄铁矿化较发育，呈星点状分布颗粒细小。'
str11 = '构造碎裂岩灰聲-灰黑色，局部灰白色，粒状变晶结构，碎裂结构，块状构造、片状构造。岩石原 岩为斜长角闪片岩，成分以角闪石为主，斜长石为次，碎裂石英、绿帘石、方解石黄铁矿 等，岩石受构造蚀变影响，大部分呈碎块状，局部呈碎粉状、泥状，局部夹硅化、黄铁矿 化斜长角闪片岩，局部岩石成分石英含量大于90%，岩石具桂化、黄铁矿化、碳酸盐化、 碎裂岩化，硅化呈脉状、块状、觀状，黄铁矿呈浸染状、星点状、斑点状，碳酸盐化 多呈细脉状分布。孔深539.84-541.36米段岩石成分石英含量大于95%，少量石榴子石、黄铁矿等，颜色 灰白色。孔‘542.54-543.24米段岩石呈碎粉状，裂隙面夹构造泥，成分多为绿泥石、绿帘石、 石英，姆黄铁矿等。'
str12 = '黄铁矿化绿泥斜长片岩灰白色-灰黑色，碎裂结构，它形粒状变晶结构，块状-片状构造。矿物成分以斜长石为 主，石英为次，少量绿帘石、黄铁矿、方解石等。局部夹硅化、黄铁矿化斜长角闪片岩。 岩石破碎，多呈碎块状，岩石硅化、黄铁矿化较强烈，呈浸染状、细脉状分布，黄铁矿颗 粒细小，浅黄色，大小〇.15-0.5mm不等，岩石片理搬育。岩石碎裂岩化麵，裂隙发育'
str13 = '黄铁矿化绿泥斜长片岩（矿化带）灰白色，它形粒状变晶结构，块状一片状构造。主要矿物成分斜长石含量大于80％，少量矗熙化鼯浸染状、块状分布。沿裂隙面充填多为细脉状石英、黄铁矿呈浸染状、星点状、斑点状、细脉状分布，细脉状黄铁矿集合体多于石英脉有关系，绿泥石多沿裂隙面呈薄膜状、皮壳状分布，局部岩石碳酸盐化较发育，多沿裂隙充填呈细脉状。'
str14 = '黄铁矿化绿泥斜长片岩(矿化带）孔深585.71-585.91米段岩石硅化强烈，灰白色石英脉沿裂隙充填，硅化呈浸染状、脉状、块状。375-380回次岩石大部分较破碎，呈碎块状。'
str15 = '金矿石经化#分析，H129AU品位为3.18)< 10 经野外二次编录，该段为金矿互，矿石矿物为黄發矿，呈半自形 - 它形粒状，粒径0.2 - 0.4聊浅黄色。脉石矿物为為长石，含量大于90 %，其他见石英和方麻等〇'
str16 = '构造矿化带灰黑夹杂灰白色，碎裂结构，块状构造、片状构造。矿物成分以石英、长石为主，少量 方解石、碳质成分、黄铁矿等。该层为构造带，岩石破碎，裂隙发育，沿裂隙充填碳质成 分，岩石硅化、莆铁矿化、碳酸盐化较强。'
str17 = '斜长角闪片岩灰绿色，粒柱状变晶结构，块状-片状构造。矿物成分以角闪石、斜长石为主，少量 绿帘石及置黄铁矿等。岩石较破碎，孔深602.01403.16米段岩石黄铁矿化较发育，呈斑点状、浸染状分布。'
str18 = '构造矿化带灰黑夹杂灰白色，碎裂结构，碎块状构造、片状构造。矿物成分以石英为主，长石、碳质矿物为次，傾方麻、黄铁矿等。'
str19 = '构造矿化带灰黑夹杂灰白色，碎裂结构，碎块状构造、片状构造岩石破碎硅化、黄铁矿化较强， 呈浸染状、脉状、块状分布，局部岩石碳酸盐化较强，呈块状、细脉状分布。'
str20 = '构造碎裂斜长角闪片岩灰绿色，碎裂结构，它形粒状变晶结构，块状构造。矿物成分主要为角闪石、斜长石、 石艱少量绿帘石.黄铁矿等。岩石片理不发育。岩石原岩为斜长角闪片岩，受构造影响3岩石碎裂岩化发育，呈碎块状，岩石中可见少 量细粒微铁矿'
str21 = '矿倾变带灰白色、灰绿、灰黑色，碎裂结构，碎块状构造、片状构造。矿物成分主要为斜长石、 石英，少量绿泥石、绿帘石、方解石及黄铁矿、碳质成分等。岩石局部片理较发育，局部 岩石受构造影响呈粉末状。岩石普具黄铁矿化，娜岩石硅化、碳酸盐化较发育，黄铁矿多呈浸染状、斑点状分布 ，部分呈块状、星点状分布，石英、方解石多呈块状、细脉状分布，局部呈浸染状分 布。岩石受构造影响强烈，原岩岩性肉眼分辨不清，多呈大小约3- 15mmW棱角状碎块， 局部岩石呈粉末状，雜易碎。'
str = [str1, str2, str3, str4, str5, str6, str7, str8, str9, str10, str11, str12, str13, str14, str15, str16, str17,
       str18, str19, str20, str20, str21]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)

path = './Zk1431.csv'
str1 = '碎裂岩化斜长角闪片岩颜色为灰绿、灰黑色，碎裂结构，定向构造。该层岩石受构造蚀麟响，岩石破碎较 重，呈碎裂岩化。'
str2 = '金矿石经化学分析，H11-H12号样金平均品位为11.32X HT6,为金矿石。野外二次编录 ，矿石矿物为黄铁矿，呈半自形一它形粒状，粒径〇.1-〇.2吗浅黄色，呈细粒状分布’含 量约2%。脉石矿物主要为角闪石、斜长石，次为石英和绿帘石等。角闪石和斜长石含量 约85%，石英含量约5、'
str3 = '弱硅化斜长角闪片岩颜色为灰绿、灰白色，粒柱状变晶结构，片状构造。主要矿物成分角闪石含量50-55 %，斜长石含量30%，其它为石英及少量黑云母。该层岩石具硅化，硅化较弱，呈团块状 分布，粒径(U-OJcmo该层岩石局部可见有少量浅黄色黄铁矿，呈细粒状分布，粒径0.卜 〇.411叫呈自形-半自形晶、它形晶。'
str4 = '斜长角闪片岩颜色为灰绿、灰黑色，粒柱状变晶结构，片状构造。主要矿物成分角闪石含量55%， 斜长石含量35。/。，其它为石英及少量黑云母。岩石中沿裂隙面上可见有少量碳酸盐化及铁 红色氧化铁质薄膜。沿裂隙面上还可见有少量长英质细脉，呈细脉状、条带状分布，脉宽 0_l-0.3cm局部较破碎，呈碎裂岩化。'
str = [str1, str2, str3, str4]
for i in str:
    r1, r2, r3 = save_data.match(i)
    save_data.save(r1, r2, r3, path)
